app/services/post/creator.rb

    def thread
      @thread ||= begin
        thread_id = params[:thread_id].presence
        Post.find(thread_id) if thread_id
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create_a_status_update
      status = Status.new(text: status_text)
      post.postable = status
      post.user = creator
      post.thread = thread
      post.save
---
INSERT INTO "posts" ("user_id", "thread_id", "postable_type", "postable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 14], ["thread_id", 3], ["postable_type", "Status"], ["postable_id", 6], ["created_at", "2021-05-02 14:07:11.136739"], ["updated_at", "2021-05-02 14:07:11.136739"]]
INSERT INTO "statuses" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "yeaa now i did the reply form and it's a MODAL BAHAHAHA"], ["created_at", "2021-05-02 14:07:11.130676"], ["updated_at", "2021-05-02 14:07:11.130676"]]