app/services/post/picture_attacher.rb

INSERT INTO "pictures" ("post_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["post_id", 9], ["created_at", "2021-05-02 15:27:35.700168"], ["updated_at", "2021-05-02 15:27:35.700168"]]
---
    def handle_from_file_upload
      picture = post.pictures.build
      picture.file.attach(blob_arg)
      picture.save!