app/views/timelines/_line.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."post_id" = $1  [["post_id", 9]]
---
    <div class="pictures">
  <% post.pictures.each do |picture| %>