app/models/post.rb

  scope :written_by, -> (username) {
    poster = User.find_by_username(username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "shahershamroukh"], ["LIMIT", 1]]