app/models/user.rb

SELECT "users".* FROM "users" WHERE (username = 'shahershamroukh@gmail.com' OR email = 'shahershamroukh@gmail.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def self.find_authenticatable(login)
      where("username = :value OR email = :value", value: login).first